Revit 2026 API

# TextNodeText Property

---

The content of the text annotation as a plain string stripped of all formatting.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Text { get; }
```
```vb
Public ReadOnly Property Text As String
	Get
```
```cpp
public:
property String^ Text {
	String^ get ();
}
```
```fsharp
member Text : string with get
```

#### Property Value

String

The text may contain new-lines if there are any in the text annotation.

#### Reference

TextNode Class

Autodesk.Revit.DB Namespace